def solution(n):
    ans = 0
    
    # k 칸 앞으로 점프하거나, 현재까지 온거리 x 2 에 해당하는 위치로 순간이동 가능
    
    #n이 최대 10억? -> 배열도 못만듬
    # BFS도 안됨
    # 거꾸로 N에서 0으로
    # N이 10억처럼 너무 큰 경우, 반으로 줄어드는 규칙이 있는지 찾아보자
    
    # N에 도착하기 직전에 마지막 한번은 무엇이었을까?
    # N이 짝수라면, N/2에서 순간이동할 수 있음
    # N이 홀수라면 항상 짝수 위치에 도착하게 된다. 즉 마지막은 점프였겠지
    
    while n > 0:
        if n % 2 == 1:      # 홀수 → 점프로 왔음
            n -= 1
            ans += 1
        else:               # 짝수 → 순간이동으로 왔음 (공짜)
            n //= 2

    
    return ans